## **Filtering DataFrame**

In [2]:
import numpy as np
import pandas as pd

In [6]:
emp = pd.read_csv("data/employees.csv", parse_dates=["Start Date"])
emp

C:\Users\toapr\AppData\Local\Temp\ipykernel_1656\1850074891.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  emp = pd.read_csv("data/employees.csv", parse_dates=["Start Date"])

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
2         Maria  Female        NaT  130590.0  False       Finance
3         Jerry     NaN 2005-03-04  138705.0   True       Finance
4         Larry    Male 1998-01-24  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN    NaN           NaN

[1001 rows x 6 columns]

In [7]:
emp.head()

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male 1993-08-06       NaN   True  Marketing
1     Thomas    Male 1996-03-31   61933.0   True        NaN
2      Maria  Female        NaT  130590.0  False    Finance
3      Jerry     NaN 2005-03-04  138705.0   True    Finance
4      Larry    Male 1998-01-24  101004.0   True         IT

In [ ]:
emp.info()          # to get the more info on data and to inspect the data

# mgmt is True or False. so it should be boolean instead Object. 
# Salary column has 2 missing values. 1001-999, have to fill the missing values with 0. and convert the type to int
# Gender should be a different data type called category. 
# Team should also be category

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), float64(1), object(3)
memory usage: 40.2+ KB

#### **Using astype() method() change the datatype of a column**

In [19]:
# mgmt column

emp["Mgmt"] = emp["Mgmt"].astype(bool)

In [20]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      1001 non-null   int64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), int64(1), object(3)
memory usage: 40.2+ KB

In [21]:
# Salary column

emp["Salary"]
# there are two missing values one is at the beginning and one is at the end

0            0
1        61933
2       130590
3       138705
4       101004
         ...
996      42392
997      96914
998      60500
999     129949
1000         0
Name: Salary, Length: 1001, dtype: int64

In [22]:
emp["Salary"] = emp["Salary"].fillna(0).astype(int)
emp.info()

# NaN values in Salary column marked them as 0 and changed the data type to int

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      1001 non-null   int64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), int64(1), object(3)
memory usage: 40.2+ KB

In [23]:
# Gender column - changing the data type to category

emp["Gender"] = emp["Gender"].astype("category")

emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      1001 non-null   int64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](1), int64(1), object(2)
memory usage: 33.5+ KB

In [24]:
# Team column - should be a category

emp["Team"] = emp["Team"].astype("category")

emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      1001 non-null   int64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](1), int64(1), object(1)
memory usage: 27.0+ KB

In [ ]:
# check the shape

emp.shape           # 1001 rows and 6 columns

(1001, 6)

### **Filtering the DataFrame using a Single Condition**

In [27]:
emp["First Name"] = "Maria"

In [28]:
emp

     First Name  Gender Start Date  Salary   Mgmt          Team
0         Maria    Male 1993-08-06       0   True     Marketing
1         Maria    Male 1996-03-31   61933   True           NaN
2         Maria  Female        NaT  130590  False       Finance
3         Maria     NaN 2005-03-04  138705   True       Finance
4         Maria    Male 1998-01-24  101004   True            IT
...         ...     ...        ...     ...    ...           ...
996       Maria    Male 1984-01-31   42392  False       Finance
997       Maria    Male 2013-05-20   96914  False       Product
998       Maria    Male 2013-04-20   60500  False  Business Dev
999       Maria    Male 2012-05-15  129949   True         Sales
1000      Maria     NaN        NaT       0   True           NaN

[1001 rows x 6 columns]